
 - [Test Stratergies]()
 - [Test result]()
 - [Code/test coverage]()
 - [Test Stratergies]()
 - [Line change and Number commit of Group]()

 <hr />

 <h1>Test Stratergies</h1>
 <p>
 ในการทดสอบระบบการค้นหาและจองเตียง จะมีการแบ่งรูปแบบของการทดสอบออกเป็น
 3 ส่วน ดังนี้
 </p>
 <h2>Unit test</h2>
 <ul>
 <li>
 <b>Frontend</b>
 <p>
 เป็นการทดสอบส่วนย่อยของระบบ โดยจะเน้นไปที่การทดสอบ Input
 ที่เป็นส่วนสำคัญของระบบค้นหาและจองเตียง โดยจะแบ่งย่อยๆออกเป็น 3
 ส่วน และมีการทดสอบด้วย Test case ต่าง ๆ ดังนี้
 </p>
 <b>1. ทดสอบช่องกรอก Email และรหัสผ่านในหน้า Login </b>
 <p>
 การทดสอบในส่วนนี้จะเป็นการใส่ค่า Input ในรูปแบบที่แตกต่างกัน
 โดยจะแบ่ง Test case ในการทดสอบออกเป็นทั้งหมด 3 รูปแบบ ดังนี้
 </p>
 <ol>
 <li>
 <b>ทำการ login โดยการใส่รหัสผ่านผิด</b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b>เพื่อทดสอบการ validate
 ในส่วนของช่องกรอกรหัสผ่าน ว่าสามารถทำงานได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b>ทำการ login โดยการใส่ทั้ง Email และรหัสผ่านผิด</b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b>เพื่อทดสอบการ validate
 ในส่วนของช่องกรอก Email และรหัสผ่าน
 ว่าสามารถทำงานได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b>ทำการ login โดยการใส่ทั้ง Email และรหัสผ่านให้ถูกต้อง</b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b> เพื่อทดสอบการ login
 เมื่อผู้ใช้กรอกทั้ง Email และรหัสผ่านถูกต้อง
 ว่าระบบสามารถทำงานได้จริงหรือไม่
 </p>
 </li>
 </ol>
 <b
 >2. ทดสอบช่องเลือกจังหวัดที่ต้องการค้นหาสถานที่จองเตียง
 ในหน้าค้นหาเตียง
 </b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบว่าช่องเลือกจังหวัดในหน้าค้นหาเตียง
 สามารถใช้งานและเลือกจังหวัดได้จริงหรือไม่
 </p>
 <p>
 <b>3. ทดสอบช่องเลือกวันที่ต้องการจองเตียง</b> ในหน้าการจองเตียง
 โดยในการทดสอบในส่วนนี้ จะมีการแบ่งรูปแบบของ Test case ออกเป็น 2
 รูปแบบ ดังนี้
 </p>
 <ol>
 <li>
 <b>ทำการเลือกวันที่ที่จอง เป็นวันที่ในอดีต</b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b>
 เพื่อทดสอบว่าช่องเลือกวันที่ต้องการจองเตียง สามารถ validate
 ว่าผู้ใช้ใส่วันที่ไม่ถูกต้องได้หรือไม่ (วันในอดีต)
 </p>
 </li>
 <li>
 <b>ทำการเลือกวันที่ที่จอง เป็นวันนี้หรือวันที่ในอนาคต</b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบว่าช่องเลือกวันที่ต้องการจองเตียง สามารถ validate
 ได้ว่าผู้ใช้เลือกวันที่ที่ถูกต้องหรือไม่
 (วันนี้หรือวันในอนาคต)
 </p>
 </li>
 </ol>
 </li>
 <li>
 <b>Backend</b>
 <p>
 เป็นการทดสอบส่วนย่อยของระบบ โดยจะเน้นไปที่การทดสอบ Request
 ที่เข้ามา โดยที่เป็นส่วนสำคัญของระบบค้นหาและจองเตียง
 โดยจะแบ่งย่อยๆออกเป็น 4 ส่วน และมีการทดสอบด้วย Test case ต่างๆ
 ดังนี้
 </p>
 <ol>
 <li>
 <b>ทดสอบการเรียกข้อมูลของสถานที่ให้บริการเตียง</b>
 <p>
 การทดสอบในส่วนนี้จะใช้การGet และ Post ในรูปแบบต่าง ๆ
 ในการทดสอบโดยแบ่งออกเป็น 3 รูปแบบ ดังนี้
 </p>
 <ul>
 <li>
 <b
 >ทำการเรียกข้อมูลสถานที่ให้บริการเตียงที่มีเตียงพร้อมให้บริการ</b
 >
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบการเรียกข้อมูลของสถานที่ให้บริการที่มีเตียงพร้อมให้บริการจริงหรือไม่
 </p>
 </li>
 <li>
 <b
 >ทำการเรียกข้อมูลสถานที่ให้บริการเตียงโดยใช้เลขประจำตัวของสถานที่ให้บริการเตียง</b
 >
 <p>
 <b>เป้าหมายในการทดสอบ : </b>
 เพื่อทดสอบการเรียกข้อมูลของสถานที่ให้บริการว่าสามารถใช้เลขประจำตัวของสถานที่ให้บริการเตียงในการเรียกข้อมูลได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b
 >ทำการเรียกข้อมูลสถานที่ให้บริการเตียงโดยใช้เลขประจำตัวของผู้ให้บริการเตียง</b
 >
 <p>
 <b>เป้าหมายในการทดสอบ : </b>
 เพื่อทดสอบการเรียกข้อมูลของสถานที่ให้บริการว่าสามารถใช้เลขประจำตัวของผู้ให้บริการเตียงในการเรียกข้อมูลได้จริงหรือไม่
 </p>
 </li>
 </ul>
 </li>
 <li>
 <b>ทดสอบการเข้าสู่ระบบและการสมัครสมาชิก</b>
 <p>
 การทดสอบในส่วนนี้จะใช้การส่งRequest ในรูปแบบต่าง ๆ
 ในการทดสอบโดยแบ่งออกเป็น 7 รูปแบบ ดังนี้
 </p>
 <ul>
 <li>
 <b
 >ทำการส่งRequest login โดยการส่งEmail
 ที่ไม่มีอยู่ในระบบ</b
 >
 <p>
 <b>เป้าหมายในการทดสอบ : </b>เพื่อทดสอบการรับค่า Request
 มาตรวจสอบว่าEmailที่ได้รับมีอยู่จริงในระบบหรือไม่
 </p>
 </li>
 <li>
 <b>ทำการส่งRequest login โดยการส่งEmail ที่มีรหัสผ่านผิด</b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b>เพื่อทดสอบการรับค่า Request
 มาตรวจสอบว่าEmailที่ได้รับส่งเข้ามามีการตรวจสอบรหัสผ่านได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b
 >ทำการส่งRequest login โดยการส่งทั้ง Email
 และรหัสผ่านให้ถูกต้อง</b
 >
 <p>
 <b>เป้าหมายในการทดสอบ : </b>เพื่อทดสอบการรับค่า Request
 มากตรวจสอบทั้งEmailและรหัสผ่านได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b
 >ทำการส่งRequest register
 โดยการส่งข้อมูลการสมัครสมาชิกให้ไม่ถูกต้อง</b
 >
 <p>
 <b>เป้าหมายในการทดสอบ : </b>เพื่อทดสอบการรับค่า Request
 มาตรวจสอบว่าข้อมูลการสมาชิกถูกต้องจริงหรือไม่
 </p>
 </li>
 <li>
 <b
 >ทำการส่ง Request register
 โดยการส่งข้อมูลการสมัครสมาชิกให้ถูกต้อง</b
 >
 <p>
 <b>เป้าหมายในการทดสอบ : </b>เพื่อทดสอบการรับค่า Request
 มาตรวจสอบว่าข้อมูลการสมาชิกถูกต้องจริงหรือไม่
 </p>
 </li>
 <li>
 <b>
 ทำการส่งRequest register
 โดยการส่งข้อมูลการสมัครสมาชิกให้มีEmailที่มีในระบบอยู่แล้ว
 </b>
 <p>
 <b>เป้าหมายในการทดสอบ :</b>เพื่อทดสอบการรับค่า Request
 มาตรวจสอบว่าข้อมูลการสมาชิกมีEmailที่มีอยู่แล้วในระบบจริงหรือไม่
 </p>
 </li>
 <li>
 <b>
 ทำการส่ง Request register
 โดยการส่งข้อมูลการสมัครสมาชิกให้มีเลขบัตรประจำตัวมีการใช้ซ้ำในระบบ
 </b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b>เพื่อทดสอบการรับค่า Request
 มาว่ามีการตรวจสอบข้อมูลเลขบัตรประจำตัวที่มีอยู่แล้วในระบบจริงหรือไม่
 </p>
 </li>
 </ul>
 </li>
 <li>
 <b>ทดสอบการจองเตียงกับการเรียกประวัติการจองเตียง</b>
 <p>
 การทดสอบในส่วนนี้จะใช้การเรียกข้อมูลและส่งRequest ในรูปแบบต่าง
 ๆ ในการทดสอบโดยแบ่งออกเป็น 7 รูปแบบ ดังนี้
 </p>
 <ul>
 <li>
 <b>ทำการเรียกประวัติการจองเตียงทั้งหมด</b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบว่ามาสามารถเรียกประวัติการจองเตียงทั้งหมดได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b
 >ทำการเรียกประวัติการจองเตียงโดยใช้เลขประจำตัวของประวัติการจองเตียง</b
 >
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบการเรียกข้อมูลของประวัติการจองเตียงว่าสามารถใช้เลขประจำตัวของประวัติการจองเตียงในการเรียกข้อมูลประวัติการจองเตียงได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b>
 ทำการเรียกประวัติการจองเตียงทั้งหมดของผู้ใช้
 โดยใช้เลขประจำตัวของผู้ให้บริการเตียง
 </b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบการเรียกข้อมูลของประวัติการจองเตียงว่าสามารถใช้เลขประจำตัวของผู้ให้บริการเตียงในการเรียกข้อมูลประวัติการจองของผู้ใช้คนนั้นได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b
 >ทำการเรียกประวัติการจองเตียงทั้งหมดของสถานที่ให้บริการเตียง
 โดยใช้เลขประจำตัวของสถานที่ให้บริการเตียง</b
 >
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบการเรียกข้อมูลของประวัติการจองเตียงว่าสามารถใช้เลขประจำตัวของสถานที่ให้บริการเตียงในการเรียกข้อมูลประวัติการจองของสถานที่ให้บริการเตียงได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b
 >ทำการเรียกประวัติการจองเตียงทั้งหมดของสถานที่ให้บริการเตียง
 โดยใช้เลขประจำตัวของสถานที่ให้บริการเตียงที่ไม่มีประวัติการจองเตียง</b
 >
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบการเรียกข้อมูลของประวัติการจองเตียงว่าสามารถตรวจสอบเลขประจำตัวของสถานที่ให้บริการเตียงที่ไม่มีข้อมูลประวัติการจองในระบบได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b> ทำการจองเตียง โดยการส่งข้อมูลถูกต้อง </b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบว่ามาสามารถจองเตียงแล้วตรวจสอบความเพียงพอของเตียงได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b> ทำการจองเตียง โดยสถานที่ให้บริการเตียงเต็ม </b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบว่ามาสามารถจองเตียงแล้วตรวจสอบความเพียงพอของเตียงได้จริงหรือไม่
 </p>
 </li>
 </ul>
 </li>
 <li>
 <b> ทดสอบการเรียกและแก้ไขข้อมูลของผู้ใช้ </b>
 <p>
 การทดสอบในส่วนนี้จะใช้การเรียกข้อมูลและส่งRequest ในรูปแบบต่าง
 ๆ ในการทดสอบโดยแบ่งออกเป็น 6 รูปแบบ ดังนี้
 </p>
 <ul>
 <li>
 <b>ทำการเรียกข้อมูลของผู้ใช้ โดยใช้เลขประจำตัวของผู้ใช้</b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบว่ามาสามารถเรียกของผู้ใช้โดยใช้เลขประจำตัวของผู้ใช้ได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b
 >ทำการเรียกข้อมูลของผู้ใช้
 โดยใช้เลขประจำตัวของผู้ใช้ที่ไม่มีในระบบ</b
 >
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบว่ามาสามารถตรวจสอบการเรียกของผู้ใช้โดยใช้เลขประจำตัวของผู้ใช้ที่ไม่ในระบบได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b> ทำการแก้ไขข้อมูลของผู้ใช้ โดยผู้ใช้ที่มีในระบบ </b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบว่ามาสามารถแก้ไขข้อมูลของผู้ใช้ได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b> ทำการแก้ไขข้อมูลของผู้ใช้ โดยผู้ใช้ที่ไม่มีในระบบ </b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบว่าระบบสามารถตรวจสอบการแก้ไขข้อมูลของผู้ใช้ในระบบได้จริงหรือไม่
 </p>
 </li>
 <li>
 <b
 >ทำการเปลี่ยนรหัสผ่านของผู้ใช้ โดยมีรหัสผ่านเก่าที่ถูกต้อง
 </b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b
 >เพื่อทดสอบว่าระบบสามารถตรวจสอบรหัสผ่านเก่าของผู้ใช้ว่ามีความถูกต้องจริงหรือไม่
 </p>
 </li>
 <li>
 <b
 >ทำการเปลี่ยนรหัสผ่านของผู้ใช้
 โดยมีรหัสผ่านเก่าที่ไม่ถูกต้อง
 </b>
 <p>
 <b>เป้าหมายในการทดสอบ : </b>
 เพื่อทดสอบว่าระบบสามารถตรวจสอบรหัสผ่านเก่าของผู้ใช้ว่ามีความถูกต้องจริงหรือไม่
 </p>
 </li>
 </ul>
 </li>
 </ol>
 </li>
 </ul>
 <h2>Component test</h2>
 <ul>
 <li>
 <b>Frontend</b>
 <p>
 เป็นการทดสอบว่าในแต่ละหน้าที่เกี่ยวข้องกับ feature จองเตียงนั้น
 มีส่วนประกอบ หรือ component ที่ควรจะอยู่ในหน้านั้น ๆ
 ครบถ้วนหรือไม่ โดยจะเน้นเฉพาะส่วนของ Frontend ที่เกี่ยวข้อง
 การทดสอบในส่วน Component test จะสามารถแบ่งออกได้เป็น 4 ส่วนดังนี้
 </p>
 <ol>
 <li>
 <b>การทำ Component test ในส่วนของหน้า login </b
 >เป็นการทดสอบเพื่อดูว่าหน้า login
 มีส่วนประกอบต่างๆครบถ้วนหรือไม่ โดยในหน้า login
 จะมีส่วนประกอบที่ต้องมีอยู่ทั้งหมด 3 ส่วนประกอบ ได้แก่
 <ul>
 <li>ช่องกรอก Email ของผู้ใช้</li>
 <li>ช่องกรอกรหัสผ่านของผู้ใช้</li>
 <li>ปุ่มสำหรับกดเพื่อทำการ Login</li>
 </ul>
 </li>
 <li>
 <b>การทำ Component test ในส่วนของหน้า main</b>
 เป็นการทดสอบเพื่อดูว่าหน้า main มีส่วนประกอบต่างๆครบถ้วนหรือไม่
 โดยในหน้า main จะมีส่วนประกอบที่ต้องมีอยู่ทั้งหมด 3 ส่วนประกอบ
 ได้แก่
 <ul>
 <li>ปุ่มสำหรับกด เพื่อเข้าถึงหน้าค้นหาเตียง</li>
 <li>ปุ่มสำหรับกด เพื่อเข้าถึงหน้าจองเตียง</li>
 <li>ช่องแสดงชื่อ และนามสกุลของผู้ใช้</li>
 </ul>
 </li>
 <li>
 <b>การทำ Component test ในส่วนของหน้าค้นหาเตียง</b> เป็นการทดสอบ
 เพื่อดูว่าหน้าค้นหาเตียงมีส่วนประกอบต่างๆครบถ้วนหรือไม่
 โดยในหน้าค้นหาเตียงจะมีส่วนประกอบที่ต้องมีอยู่ทั้งหมด 4
 ส่วนประกอบ ได้แก่
 <ul>
 <li>ช่องเลือกจังหวัดที่ต้องการค้นหาสถานที่ให้บริการเตียง</li>
 <li>
 จำนวนจังหวัดที่มีให้เลือกในช่องเลือกจังหวัด
 ต้องมีจำนวนตัวเลือกทั้งหมด 78 ตัวเลือก (77 จังหวัด +
 ทุกจังหวัด)
 </li>
 <li>
 ช่องแสดงตัวเลขของจำนวนสถานที่ให้บริการเตียงในจังหวัดที่ผู้ใช้เลือก
 </li>
 <li>
 ช่องแสดงรายละเอียดของสถานที่ให้บริการเตียง
 ตัองมีการแสดงผลข้อมูลต่าง ๆ ดังนี้
 </li>
 </ul>
 <br />
 <table>
 <tr>
 <td>
 <b>1. จำนวนเตียงที่ว่างอยู่</b>
 </td>
 </tr>
 <tr>
 <td>
 <b>2. จังหวัดที่ตั้งของสถานที่ให้บริการเตียง</b>
 </td>
 </tr>
 <tr>
 <td>
 <b>3. ซอย/ถนน ที่ตั้งของสถานที่ให้บริการเตียง </b>
 </td>
 </tr>
 <tr>
 <td>
 <b>4. ตำบล/แขวง, เขต/อำเภอ ของสถานที่ให้บริการเตียง</b>
 </td>
 </tr>
 <tr>
 <td>
 <b
 >5. ปุ่มสำหรับกด เพื่อทำการจองเตียง
 หรือดูรายละเอียดของสถานที่ให้บริการเตียงนั้น ๆ
 เพิ่มเติม</b
 >
 </td>
 </tr>
 </table>
 </li>
 <li>
 <b>การทำ Component test ในส่วนของหน้าการจองเตียง</b>
 เป็นการทดสอบ
 เพื่อดูว่าหน้าจองเตียงมีส่วนประกอบต่างๆครบถ้วนหรือไม่
 โดยในหน้าจองเตียงจะมีส่วนประกอบที่ต้องมีอยู่ทั้งหมด 3 ส่วนประกอบ
 ได้แก่
 <ul>
 <li>
 ช่องแสดงรายละเอียดต่างๆของสถานที่ให้บริการเตียง
 จะตัองมีส่วนประกอบย่อย ๆ อยู่ทั้งหมด ดังนี้
 <br /><br />
 <table>
 <tr>
 <td>
 <b
 >1.
 ปุ่มสำหรับกดเพื่อดูดำแหน่งของสถานที่ให้บริการเตียง
 ผ่านบริการของ Google Maps</b
 >
 </td>
 </tr>
 <tr>
 <td>
 <b
 >2. ชื่อและนามสกุล
 ของเจ้าของสถานที่ให้บริการเตียง</b
 >
 </td>
 </tr>
 <tr>
 <td>
 <b>3. เบอร์โทรติดต่อของสถานที่ให้บริการเตียง</b>
 </td>
 </tr>
 <tr>
 <td>
 <b>4. LINE ID สำหรับติดต่อสถานที่ให้บริการเตียง</b>
 </td>
 </tr>
 <tr>
 <td><b>5. ข้อมูลที่อยู่ของสถานที่ให้บริการเตียง</b></td>
 </tr>
 <tr>
 <td>
 <b
 >6.
 จำนวนเตียงที่ว่างอยู่ของสถานที่ให้บริการเตียงที่ผู้ใช้เลือก</b
 >
 </td>
 </tr>
 </table>
 </li>
 <li>ช่องเลือกวันที่ผู้ใช้ต้องการเข้ามาพักอาศัย</li>
 <li>ปุ่มสำหรับกด เพื่อทำการยืนยันการจองเตียง</li>
 </ul>
 </li>
 </ol>
 </li>
 </ul>
 <h2>End-to-End test</h2>
 <ul>
 <li>
 <b> Frontend </b>
 <p>
 เป็นการทดสอบการใช้งาน ตัวfeature จองเตียงตั้งแต่เริ่มจนจบ
 ซึ่งจะเริ่มตั้งแต่หน้า login => index => findbeds => buybeds
 โดยมีจุดประสงค์เพื่อทดลองว่า featureนี้ สามารถใช้งานได้จริง
 โดยเริ่มจาก
 </p>
 <ol>
 <li>
 การกรอกข้อมูล email และ รหัสผ่านให้ถูกต้อง
 เพื่อลงชื่อเข้าใช้งานที่หน้า login
 </li>
 </ol>
 <ol>
 <li>กดปุ่มค้นหาเตียงที่หน้า index</li>
 </ol>
 <ol>
 <li>ทำการเลือกจังหวัดที่ต้องการค้นหาสถานที่ ที่หน้า findbeds</li>
 </ol>
 <ol>
 <li>กดดูรายละเอียดของสถานที่ ที่ต้องการจองเตียง</li>
 </ol>
 <ol>
 <li>ทำการเลือกวันที่ ที่ต้องการจองเตียง</li>
 </ol>
 <ol>
 <li>กดปุ่ม จอง จากนั้น กดปุ่ม ยืนยัน เพื่อทำการจอง</li>
 </ol>
 </li>
 </ul>
 <h1>Instruction of test</h1>
 <p>
 <b> เทคโนโลยีที่เลือกใช้ </b>
 </p>
 <ul>
 <li>Cypress: ใช้ในการทดสอบส่วน Frontend</li>
 <li>Mocha: ใช้ในการทดสอบส่วน Backend</li>
 <li>nyc: ใช้ในการหา Code coverage Backend</li>
 </ul>
 <p><b>วิธีการ run automated test</b></p>
 <p><b>Frontend</b></p>
 <ol>
 <li>ทำการ clone project จาก github มา และเปิดไฟล์ด้วย Vscode</li>

 <li>
 เปิด terminal ใน Vscode ขึ้นมา และพิมพ์คำสั่ง cd frontend-demo-test
 </li>

 <li>
 หลังเข้ามาที่ frontend-demo แล้ว พิมพ์คำสั่ง yarn เพื่อติดตั้ง node
 module
 </li>

 <li>
 หลังพิมพ์คำสั่ง yarn ให้พิมพ์คำสั่ง yarn add cypress
 เพื่อทำการติดตั้ง cypress
 </li>

 <li>
 หลังติดตั้ง cypress ให้พิมพ์คำสั่ง yarn cypress open
 เพื่อเปิดหน้าต่าง run test cypress ขึ้นมา แล้วเลือกไฟล์ Test
 ที่ต้องการ run
 </li>

 <li>
 เมื่อมีหน้าต่าง run test cypress ขึ้นมาแล้ว ให้ทำการ double click
 เพื่อเลือกรูปแบบของ test ที่ต้องการ run test (unit, component, e2e)
 </li>
 </ol>

 <p><b>Backend</b></p>
 <ol>
 <li>ทำการ clone project จาก github มา และเปิดไฟล์ด้วย Vscode</li>

 <li>
 เปิด terminal ใน Vscode ขึ้นมา และพิมพ์คำสั่ง cd frontend-demo-test
 </li>

 <li>
 หลังเข้ามาที่ frontend-demo แล้ว พิมพ์คำสั่ง yarn เพื่อติดตั้ง node
 module
 </li>

 <li>
 หลังพิมพ์คำสั่ง yarn ให้พิมพ์คำสั่ง yarn add mocha chai chai-http
 nyc --dev เพื่อทำการติดตั้ง mocha
 </li>

 <li>
 หลังจากติดตั้ง ให้พิมพ์คำสั่ง yarn run test เพื่อทำการรันคำสั่ง test
 </li>

 <li>หลังจากจะมีหน้าต่างแสดงผลการ test ออกมา</li>
 </ol>
 <h1>Test result</h1>
 <p>ผลการดำเนินการของการทำ Testing แบ่งออกได้เป็น 3 ส่วน ดังนี้</p>
 <h2>Unit Test</h2>
 <ul>
 <li>
 <b>Frontend</b>
 <p>
 ผลการทดสอบ unit test ในส่วนของ Frontend จะแบ่งออกแป็น 3 ส่วน
 เหมือนที่ได้กล่าวไว้ในส่วนของ test stratergies ดังนี้
 </p>
 <ol>
 <li>
 ทดสอบช่องกรอก Email และ Password
 <ul>
 <li>
 ทำการ login โดยการใส่รหัสผ่านผิด และทำการกดปุ่ม login
 <p>
 <b> ผลการทดสอบ :</b> ในส่วนของหน้า login มีการ alert
 ข้อความ “โปรดกรอกข้อมูลให้ถูกต้อง” และแสดงข้อความตัวสีแดง
 “โปรดใส่รหัสผ่านให้ถูกต้อง” ใต้ช่องกรอก Password
 <b>(Success)</b>
 </p>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/1.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 <li>
 <b
 >ทำการ login โดยการใส่ทั้ง Email และรหัสผ่านผิด
 และทำการกดปุ่ม login</b
 >
 <p>
 <b>ผลการทดสอบ : </b>ในส่วนของหน้า login มีการ alert
 ข้อความ “โปรดกรอกข้อมูลให้ถูกต้อง” และแสดงข้อความตัวสีแดง
 “โปรดใส่รหัสผ่านให้ถูกต้อง” และ “โปรดใส่ Email ให้ถูกต้อง”
 ใต้ช่องกรอก Password และช่องกรอก Email <b>(Success)</b>
 </p>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/2.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 <li>
 ทำการ login โดยการใส่ทั้ง Email และรหัสผ่านให้ถูกต้อง
 และทำการกดปุ่ม login ผลการทำสอบ : login สำเร็จและแสดงหน้า
 Main page <b>(Success)</b>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/3.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 </ul>
 </li>
 <li>
 <b
 >ทดสอบช่องเลือกจังหวัดที่ต้องการค้นหาสถานที่จองเตียง
 ในหน้าค้นหาเตียง
 </b>
 <ul>
 <li>
 <b>ทำการเลือกจังหวัดกรุงเทพฯ และกดปุ่มค้นหา</b>
 <p>
 <b>ผลการทดสอบ : </b
 >แสดงผลข้อมูลของสถานที่จองเตียงเฉพาะในส่วนของจังหวัดกรุงเทพฯเท่านั้น
 <b>(Success)</b>
 </p>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/4.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 </ul>
 </li>
 <li>
 ทดสอบช่องเลือกวันที่ต้องการจองเตียง
 <ul>
 <li>
 ทำการเลือกวันที่ที่จอง เป็นวันในอดีต และกดปุ่มจองเตียง
 <p>
 <b>ผลการทดสอบ : </b>ในส่วนของหน้าจองเตียง มีการ alert
 ข้อความ “โปรดกรอกข้อมูลให้ถูกต้อง” และแสดงข้อความตัวสีแดง
 “โปรดเลือกวันที่ให้ถูกต้อง” ใต้ช่องเลือกวันที่
 <b>(Success)</b>
 </p>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/5.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 <li>
 <b
 >ทำการเลือกวันที่ที่จอง เป็นวันนี้หรือวันในอนาคต
 และกดปุ่มจองเตียง</b
 >
 <p>
 <b>ผลการทดสอบ :</b>
 สามารถจองเตียงได้สำเร็จและแสดงผลข้อมูลการจองเตียงทั้งหมดของผู้ใช้
 </p>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/6.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 </ul>
 </li>
 </ol>
 </li>
 <li>
 <b>Backend</b>
 <p>
 ผลการทดสอบ unit test ในส่วนของ Backend จะแบ่งออกแป็น 4 ส่วน
 เหมือนที่ได้กล่าวไว้ในส่วนของ test stratergies ดังนี้
 </p>
 <ol>
 <li>
 <b>ทดสอบการเรียกข้อมูลของสถานที่ให้บริการเตียง</b>
 <ul>
 <li>
 <b
 >ทำการเรียกข้อมูลสถานที่ให้บริการเตียงที่มีเตียงพร้อมให้บริการ</b
 >
 <p>
 <b>ผลการทดสอบ :</b>
 สามารถเรียกข้อมูลสถานที่ให้บริการเตียงที่มีเตียงพร้อมให้บริการได้
 และได้รับข้อความ “การค้นหาสำเร็จ!” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b
 >ทำการเรียกข้อมูลสถานที่ให้บริการเตียงโดยใช้เลขประจำตัวของสถานที่ให้บริการเตียง</b
 >
 <p>
 <b>ผลการทดสอบ :</b
 >สามารถเรียกข้อมูลสถานที่ให้บริการเตียงโดยใช้เลขประจำตัวของสถานที่ได้
 และได้รับข้อความ “การค้นหาสำเร็จ!” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b
 >ทำการเรียกข้อมูลสถานที่ให้บริการเตียงโดยใช้เลขประจำตัวของผู้ใช้ที่ให้บริการเตียง</b
 >
 <p>
 <b>ผลการทดสอบ :</b>
 สามารถเรียกข้อมูลสถานที่ให้บริการเตียงโดยใช้เลขประจำตัวของผู้ใช้ที่ให้บริการเตียงได้
 และได้รับข้อความ “การค้นหาสำเร็จ!” <b>(Success)</b>
 </p>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/7.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 </ul>
 </li>
 <li>
 <b>ทดสอบการเข้าสู่ระบบและการสมัครสมาชิก</b>
 <ul>
 <li>
 <b
 >ทำการส่งRequest login โดยการส่งEmail
 ที่ไม่มีอยู่ในระบบ</b
 >
 <p>
 <b>ผลการทดสอบ : </b>ไม่สามารถLogin ได้ และได้รับข้อความ
 “อีเมลไม่มีอยู่ในระบบ กรุณาลองใหม่อีกครั้ง”
 <b>(Success)</b>
 </p>
 </li>
 <li>
 <b>ทำการส่งRequest login โดยการส่งEmail ที่มีรหัสผ่านผิด</b>
 <p>
 <b>ผลการทดสอบ : </b>ไม่สามารถLogin ได้ และได้รับข้อความ
 “รหัสผ่านไม่ถูกต้อง กรุณาลองใหม่อีกครั้ง” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b
 >ทำการส่งRequest login โดยการส่งทั้ง Email
 และรหัสผ่านให้ถูกต้อง</b
 >
 <p>
 <b>ผลการทดสอบ :</b> สามารถLogin ได้ และได้รับข้อความ
 “เข้าสู่ระบบสำเร็จ”กับข้อมูลของผู้ใช้ <b>(Success)</b>
 </p>
 </li>
 <li>
 <b
 >ทำการส่งRequest register
 โดยการส่งข้อมูลการสมัครสมาชิกให้ไม่ถูกต้อง</b
 >
 <p>
 <b>ผลการทดสอบ :</b> ไม่สามารถRegister ได้ และได้รับข้อความ
 “เกิดข้อผิดพลาดกรุณาลงทะเบียนอีกครั้งภายหลัง”
 <b>(Success)</b>
 </p>
 </li>
 <li>
 <b
 >ทำการส่งRequest register
 โดยการส่งข้อมูลการสมัครสมาชิกให้ถูกต้อง</b
 >
 <p>
 <b>ผลการทดสอบ :</b> สามารถRegister ได้ และได้รับข้อความ
 “ลงทะเบียนสำเร็จ” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b
 >ทำการส่งRequest register
 โดยการส่งข้อมูลการสมัครสมาชิกให้มีEmailที่มีในระบบอยู่แล้ว</b
 >
 <p>
 <b>ผลการทดสอบ :</b> ไม่สามารถRegister ได้ และได้รับข้อความ
 “อีเมลนี้มีอยู่ในระบบอยู่แล้ว” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b
 >ทำการส่งRequest register
 โดยการส่งข้อมูลการสมัครสมาชิกให้มีเลขบัตรประจำตัวมีการใช้ซ้ำในระบบ</b
 >
 <p>
 <b>ผลการทดสอบ :</b> ไม่สามารถRegister ได้ และได้รับข้อความ
 “เลขบัตรประจำตัวประชาชนมีการใช้ซ้ำ” <b>(Success)</b>
 </p>
 </li>
 </ul>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/8.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 <li>
 <b>ทดสอบการจองเตียงกับการเรียกประวัติการจองเตียง</b>
 <ul>
 <li>
 <b>ทำการเรียกประวัติการจองเตียงทั้งหมด</b>
 <b>ผลการทดสอบ : </b> สามารถเรียกประวัติการจองเตียงทั้งหมดได้
 และได้รับข้อความ “การค้นหาสำเร็จ!” <b>(Success)</b>
 </li>
 <li>
 <b
 >ทำการเรียกประวัติการจองเตียงโดยใช้เลขประจำตัวของประวัติการจองเตียง</b
 >
 <p>
 <b>ผลการทดสอบ : </b
 >สามารถเรียกประวัติการจองเตียงโดยใช้เลขประจำตัวของประวัติการจองได้
 และได้รับข้อความ “การค้นหาสำเร็จ!” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b
 >ทำการเรียกประวัติการจองเตียงทั้งหมดของผู้ใช้
 โดยใช้เลขประจำตัวของผู้ให้บริการเตียง</b
 >
 <p>
 <b>ผลการทดสอบ :</b>
 สามารถเรียกประวัติการจองเตียงโดยใช้เลขประจำตัวของผู้ใช้ได้
 และได้รับข้อความ “การค้นหาสำเร็จ!” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b>
 ทำการเรียกประวัติการจองเตียงทั้งหมดของสถานที่ให้บริการเตียง
 โดยใช้เลขประจำตัวของสถานที่ให้บริการเตียง
 </b>
 <p>
 <b>ผลการทดสอบ : </b>
 สามารถเรียกประวัติการจองเตียงโดยใช้เลขประจำตัวของสถานที่ให้บริการเตียงได้
 และได้รับข้อความ “การค้นหาสำเร็จ!” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b>
 ทำการเรียกประวัติการจองเตียงทั้งหมดของสถานที่ให้บริการเตียง
 โดยใช้เลขประจำตัวของสถานที่ให้บริการเตียงที่ไม่มีประวัติการจองเตียง
 </b>
 <p>
 <b>ผลการทดสอบ : </b
 >ไม่สามารถเรียกประวัติการจองเตียงโดยใช้เลขประจำตัวของสถานที่ให้บริการเตียงได้
 และได้รับข้อความ “ไม่มีข้อมูล!” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b>ทำการจองเตียง โดยการส่งข้อมูลถูกต้อง</b>
 <p>
 <b>ผลการทดสอบ :</b> สามารถทำการจองเตียงได้
 และได้รับข้อความ “จองสำเร็จ” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b>ทำการจองเตียง โดยสถานที่ให้บริการเตียงเต็ม</b>
 <p>
 <b>ผลการทดสอบ : </b>ไม่สามารถทำการจองเตียงได้
 และได้รับข้อความ “ไม่สามารถจองได้ เนื่องจากเตียงเต็ม”
 <b>(Success)</b>
 </p>
 </li>
 </ul>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/9.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 <li>
 <b>ทดสอบการเรียกและแก้ไขข้อมูลของผู้ใช้</b>
 <ul>
 <li>
 <b>ทำการเรียกข้อมูลของผู้ใช้ โดยใช้เลขประจำตัวของผู้ใช้</b>
 <p>
 <b>ผลการทดสอบ :</b> สามารถเรียกข้อมูลของผู้ใช้ได้
 และได้รับข้อความ “ไอดีที่เรียกถูกต้อง” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b
 >ทำการเรียกข้อมูลของผู้ใช้
 โดยใช้เลขประจำตัวของผู้ใช้ที่ไม่มีในระบบ</b
 >
 <p>
 <b>ผลการทดสอบ :</b> ไม่สามารถเรียกข้อมูลของผู้ใช้ได้
 และได้รับข้อความ
 “เกิดข้อผิดพลาดกรุณาลงทะเบียนอีกครั้งภายหลัง”
 <b>(Success)</b>
 </p>
 </li>
 <li>
 <b>ทำการแก้ไขข้อมูลของผู้ใช้ โดยผู้ใช้ที่มีในระบบ</b>
 <p>
 <b>ผลการทดสอบ :</b> สามารถแก้ไขข้อมูลของผู้ใช้ได้
 และได้รับข้อความ “อัพเดทข้อมูลสำเร็จ” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b>ทำการแก้ไขข้อมูลของผู้ใช้ โดยผู้ใช้ที่ไม่มีในระบบ </b>
 <p>
 <b>ผลการทดสอบ :</b> ไม่สามารถแก้ไขข้อมูลของผู้ใช้ได้
 และได้รับข้อความ “อัพเดทข้อมูลไม่สำเร็จ” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b>
 ทำการเปลี่ยนรหัสผ่านของผู้ใช้ โดยมีรหัสผ่านเก่าที่ถูกต้อง
 </b>
 <p>
 <b>ผลการทดสอบ :</b> สามารถเปลี่ยนรหัสผ่านของผู้ใช้ได้
 และได้รับข้อความ “เปลี่ยนรหัสผ่านสำเร็จ” <b>(Success)</b>
 </p>
 </li>
 <li>
 <b
 >ทำการเปลี่ยนรหัสผ่านของผู้ใช้
 โดยมีรหัสผ่านเก่าที่ไม่ถูกต้อง
 </b>
 <p>
 <b>ผลการทดสอบ :</b> ไม่สามารถเปลี่ยนรหัสผ่านของผู้ใช้ได้
 และได้รับข้อความ “รหัสผ่านไม่ถูกต้อง กรุณาลองใหม่อีกครั้ง”
 <b>(Success)</b>
 </p>
 </li>
 </ul>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/10.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 </ol>
 </li>
 </ul>
 <h2>Component Test</h2>
 <ul>
 <li>
 <b>Frontend</b>
 <p>
 ผลการทดสอบ Component test ในส่วนของ Frontend จะแบ่งออกแป็น 4 ส่วน
 เหมือนที่ได้กล่าวไว้ในส่วนของ test stratergies ดังนี้
 </p>
 <ol>
 <li>
 <b>การทำ Component test ในส่วนของหน้า login</b>
 <ul>
 <li>
 ช่องกรอก Email ของผู้ใช้
 <p>
 <b>ผลการทดสอบ :</b> ในหน้า login มีในส่วนของช่องกรอก Email
 อยู่จริง <b>(Success)</b>
 </p>
 </li>
 <li>
 ช่องกรอกรหัสผ่านของผู้ใช้
 <p>
 <b>ผลการทดสอบ :</b> ในหน้า login
 มีในส่วนของช่องกรอกรหัสผ่านอยู่จริง <b>(Success)</b>
 </p>
 </li>
 <li>
 ปุ่มสำหรับกดเพื่อทำการ Login
 <p>
 <b>ผลการทดสอบ :</b> ในหน้า login
 มีในส่วนของปุ่มสำหรับกดเพื่อทำการ Login อยู่จริง
 <b>(Success)</b>
 </p>
 </li>
 </ul>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/11.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 <li>
 <b>การทำ Component test ในส่วนของหน้า main</b>
 <ul>
 <li>
 ปุ่มสำหรับกด เพื่อเข้าถึงหน้าค้นหาเตียง
 <p>
 <b>ผลการทดสอบ :</b> ในหน้า main มีในส่วนของปุ่มสำหรับกด
 เพื่อเข้าถึงหน้าค้นหาเตียง โดยจะมีอยู่ใน 2 ส่วน ได้แก่ ใน
 navbar ของหน้า และในแทบฟีเจอร์การค้นหาและจองเตียง
 <b>(Success)</b>
 </p>
 </li>
 <li>
 ปุ่มสำหรับกด เพื่อเข้าถึงหน้าจองเตียง
 <p>
 <b>ผลการทดสอบ :</b> ในหน้า main มีในส่วนของปุ่มสำหรับกด
 เพื่อเข้าถึงหน้าจองเตียง โดยจะมีอยู่ใน 2 ส่วน ได้แก่ ใน
 navbar ของหน้า และในแทบฟีเจอร์การค้นหาและจองเตียง
 <b>(Success)</b>
 </p>
 </li>
 <li>
 ช่องแสดงชื่อ และนามสกุลของผู้ใช้
 <p>
 <b>ผลการทดสอบ :</b> ในหน้า main มีในส่วนของช่องแสดงชื่อ
 และนามสกุลของผู้ใช้อยู่จริง <b>(Success)</b>
 </p>
 </li>
 </ul>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/12.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 <li>
 <b>การทำ Component test ในส่วนของหน้าค้นหาเตียง</b>
 <ul>
 <li>
 ช่องเลือกจังหวัดที่ต้องการค้นหาสถานที่ให้บริการเตียง
 <p>
 <b>ผลการทดสอบ :</b> ในหน้าค้นหาเตียง
 มีในส่วนของช่องเลือกจังหวัดที่ต้องการค้นหาสถานที่ให้บริการเตียงอยู่จริง
 <b>(Success)</b>
 </p>
 </li>
 <li>
 จำนวนจังหวัดที่มีให้เลือกในช่องเลือกจังหวัด
 <p>
 <b>ผลการทดสอบ :</b> ในช่องเลือกจังหวัดของหน้าค้นหาเตียง
 มีจำนวนตัวเลือกอยู่ทั้งหมด 78 ตัวเลือกครบถ้วน
 ตามที่ได้กำหนดไว้ใน test stratergies <b>(Success)</b>
 </p>
 </li>
 <li>
 ช่องแสดงตัวเลขของจำนวนสถานที่ให้บริการเตียงในจังหวัดที่ผู้ใช้เลือก
 <p>
 <b>ผลการทดสอบ :</b> ในหน้าค้นหาเตียง
 มีในส่วนของช่องแสดงตัวเลขของจำนวนสถานที่ให้บริการเตียงในจังหวัดที่ผู้ใช้เลือกอยู่จริง
 <b>(Success)</b>
 </p>
 </li>
 <li>
 ช่องแสดงรายละเอียดของสถานที่ให้บริการเตียง
 <p>
 <b>ผลการทดสอบ :</b>
 ในช่องแสดงรายละเอียดของสถานที่ให้บริการเตียงในหน้าค้นหาเตียง
 มีรายละเอียดของสถานที่ให้บริการเตียงอยู่ครบถ้วน
 ตามที่ได้กำหนดไว้ <b>(Success)</b>
 </p>
 </li>
 </ul>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/13.PNG?raw=true"
 alt=""
 />
 </p>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/14.PNG?raw=true"
 alt=""
 />
 </p>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/15.PNG?raw=true"
 alt=""
 />
 </p>
 </li>
 <li>
 <b>การทำ Component test ในส่วนของหน้าการจองเตียง</b>
 <ul>
 <li>
 ช่องแสดงรายละเอียดต่างๆของสถานที่ให้บริการเตียง
 <p>
 <b>ผลการทดสอบ :</b>
 ในช่องแสดงรายละเอียดของสถานที่ให้บริการเตียงในหน้าจองเตียง
 มีรายละเอียดของสถานที่ให้บริการเตียงอยู่ครบถ้วน
 ตามที่ได้กำหนดไว้ <b>(Success)</b>
 </p>
 </li>
 <li>
 ช่องเลือกวันที่ผู้ใช้ต้องการเข้ามาพักอาศัย
 <p>
 <b>ผลการทดสอบ :</b> ในหน้าจองเตียง
 มีในส่วนของช่องเลือกวันที่ผู้ใช้ต้องการเข้ามาพักอาศัยอยู่จริง
 <b>(Success)</b>
 </p>
 </li>
 <li>
 ปุ่มสำหรับกด เพื่อทำการยืนยันการจองเตียง
 <p>
 <b>ผลการทดสอบ :</b> ในหน้าจองเตียง มีในส่วนของปุ่มสำหรับกด
 เพื่อทำการยืนยันการจองเตียงอยู่จริง <b>(Success)</b>
 </p>
 </li>

 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/a1.png?raw=true"
 alt=""
 />
 </p>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/a2.png?raw=true"
 alt=""
 />
 </p>
 </ul>
 </li>
 </ol>
 </li>
 </ul>
 <h2>End-to-End Test</h2>
 <ul>
 <li>
 <b>Frontend</b>
 <p>
 การทดสอบแบบ End To End
 จะเป็นการทดสอบที่คลอบคลุมการใช้งานทุกส่วนที่เกี่ยวข้องกับการใช้งาน
 ตัว feature การจองเตียง โดยการทดสอบนั้นจะเริ่มต้นจาก
 </p>
 <ol>
 <li>
 กรอกข้อมูลที่ email และpasswordให้ถูกต้อง ในช่องกรอกข้อมูล และ
 กดปุ่มลงชื่อเข้าใช้ที่หน้า login
 </li>
 <li>กดปุ่ม ค้นหาเตียง ที่หน้า index</li>
 <li>
 ทำการเลือกจังหวัดที่ต้องการค้นหา ที่ช่อง drop down
 จากนั้นกดปุ่มไอคอน แว่นขยาย เพื่อค้นหา ที่หน้า findbeds
 </li>
 <li>
 ทำการกดปุ่ม ดูรายละเอียด ในช่องที่เลือก เพื่อเข้าไปดูรายละเอียด
 ในหน้า buybeds
 </li>
 <li>
 ทำการเลือกวันที่ต้องการจองให้ถูกต้อง จากนั้นกดปุ่ม จอง และกดปุ่ม
 ยืนยัน เพื่อทำการจองเตียง
 </li>
 </ol>
 <p>
 <b>ผลการทดสอบ:</b> การใช้งานโดยรวมของตัว feature การจองเตียง
 สามารถใช้งานได้อย่างถูกต้องทุกส่วนตามที่ควรจะเป็น <b>(Success)</b>
 </p>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/16.gif?raw=true"
 alt=""
 width="100%"
 />
 </p>
 </li>
 </ul>
 <h1>Code/test coverage</h1>
 <b>Backend</b>
 <p align="center">
 <img
 src="https://github.com/Po-Pon/SW-Development-Tool-And-Environments-Group1/blob/main/Tasks/Task5/17.PNG?raw=true"
 alt=""
 />
 </p>
 <h1>Line change and Number commit of Group</h1>
 <p><b>wiki</b></p>
 <br>
 <table>
 <tr align="center">
 <td><b>Student No.</b></td>
 <td><b>Name</b></td>
 <td><b>Line Change (%)</b></td>
 <td><b>No. of Commit (%)</b></td>
 </tr>
 <tr align="center">
 <td><b>62070112</b></td>
 <td>นายปภัส เงาธัมมะสกุล</td>
 <td></td>
 <td></td>
 </tr>
 <tr align="center">
 <td><b>62070113</b></td>
 <td>นายประธาน นาเวียง</td>
 <td></td>
 <td></td>
 </tr>
 <tr align="center">
 <td><b>62070134</b></td>
 <td>นายพลัฏฐ์ วงศ์สิทธิพรรุ่ง</td>
 <td></td>
 <td></td>
 </tr>
 <tr align="center">
 <td><b>62070139</b></td>
 <td>นายพิชญะ สิงห์มีศรี</td>
 <td></td>
 <td></td>
 </tr>
 <tr align="center">
 <td><b>62070168</b></td>
 <td>นายวิชยุตม์ ทวิชัยยุทธ</td>
 <td></td>
 <td></td>
 </tr>
 <tr align="center">
 <td><b>62070215</b></td>
 <td>นายอคิราภ์ สีแสนยง</td>
 <td></td>
 <td></td>
 </tr>
 </table>
 <br /><br />
 <p><b>code</b></p>
 <br>
 <table>
 <tr align="center">
 <td><b>Student No.</b></td>
 <td><b>Name</b></td>
 <td><b>Line Change (%)</b></td>
 <td><b>No. of Commit (%)</b></td>
 </tr>
 <tr align="center">
 <td><b>62070112</b></td>
 <td>นายปภัส เงาธัมมะสกุล</td>
 <td></td>
 <td></td>
 </tr>
 <tr align="center">
 <td><b>62070113</b></td>
 <td>นายประธาน นาเวียง</td>
 <td></td>
 <td></td>
 </tr>
 <tr align="center">
 <td><b>62070134</b></td>
 <td>นายพลัฏฐ์ วงศ์สิทธิพรรุ่ง</td>
 <td></td>
 <td></td>
 </tr>
 <tr align="center">
 <td><b>62070139</b></td>
 <td>นายพิชญะ สิงห์มีศรี</td>
 <td></td>
 <td></td>
 </tr>
 <tr align="center">
 <td><b>62070168</b></td>
 <td>นายวิชยุตม์ ทวิชัยยุทธ</td>
 <td></td>
 <td></td>
 </tr>
 <tr align="center">
 <td><b>62070215</b></td>
 <td>นายอคิราภ์ สีแสนยง</td>
 <td></td>
 <td></td>
 </tr>
 </table>